vtk/Resolution_20/Case1Concentration/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          functions;

subSolver       incompressibleFluid;

startFrom       latestTime;

startTime       0;

subSolverTime   0;

stopAt          endTime;

endTime         5;

deltaT          0.01;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc scalarTransport(C, diffusivity=constant, D = 1e-8)

    mixingQualityCheck
    {
        type coded;

        // Load the library containing the 'coded' functionObject
        libs            ("libutilityFunctionObjects.so");

        codeInclude
        #{
            #include "volFields.H"
        #};

        codeExecute
        #{
            const volScalarField& C
            (
                mesh().lookupObject<volScalarField>("C")
            );

            const scalar maxC = max(C).value();
            const scalar meanC = C.weightedAverage(mesh().V()).value();

            const scalar mixingQuality = meanC/maxC;
            Info << "mixingQuality = " << mixingQuality << endl;

            if (mixingQuality > 0.9)
            {
                const_cast<Time&>(mesh().time()).writeAndEnd();
            }
        #};
    }
}

// ************************************************************************* //
