vtk/Resolution_20/Case1Concentration/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "717";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
104620
(
(0.0060514 0.00302579 -5.42369e-19)
(0.0176024 0.00880118 0)
(0.0286033 0.0143016 7.63247e-19)
(0.0390541 0.019527 -9.42812e-19)
(0.0489548 0.0244773 -9.32413e-19)
(0.0583054 0.0291526 1.29199e-18)
(0.067106 0.0335528 -9.13827e-19)
(0.0753565 0.037678 1.0176e-22)
...
)
;

boundaryField
{
    walls
    {
        type            noSlip;
    }
    inlet_0
    {
        type            zeroGradient;
    }
    inlet_1
    {
        type            zeroGradient;
    }
    outlet_0
    {
        type            zeroGradient;
    }
    outlet_1
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
