vtk/Resolution_20/Case1Concentration/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "717";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
104620
(
0.999721
0.999721
0.99972
0.99972
0.99972
0.99972
0.999719
0.999719
...
)
;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    inlet_0
    {
        type            fixedValue;
        value           uniform 1;
    }
    inlet_1
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet_0
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet_1
    {
        type            fixedValue;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
