vtk/Resolution_20/Case1Concentration/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "717";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
206880
(
2.73802e-18
1.53766e-12
1.05514e-17
4.47273e-12
2.1787e-17
7.26804e-12
3.5335e-17
9.92356e-12
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
44
(
-1.53766e-12
-4.47274e-12
-7.26805e-12
-9.92358e-12
-1.24393e-11
-1.48153e-11
-1.70515e-11
-1.9148e-11
...
)
;
    }
    inlet_1
    {
        type            calculated;
        value           nonuniform List<scalar> 
46
(
-1.40744e-12
-4.10025e-12
-6.67063e-12
-9.11861e-12
-1.14442e-11
-1.36473e-11
-1.57281e-11
-1.76865e-11
...
)
;
    }
    outlet_0
    {
        type            calculated;
        value           nonuniform List<scalar> 
44
(
1.53767e-12
4.47277e-12
7.26811e-12
9.92366e-12
1.24394e-11
1.48155e-11
1.70517e-11
1.91482e-11
...
)
;
    }
    outlet_1
    {
        type            calculated;
        value           nonuniform List<scalar> 
46
(
1.40741e-12
4.10015e-12
6.67049e-12
9.11842e-12
1.1444e-11
1.36471e-11
1.57278e-11
1.76861e-11
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
